import React from 'react';
import '../styles/Legal_info.css';

const PrivacyText = () => {
    
    const nextLine = <><br /><br /></> ;

    return (
        <div>
           <div>Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую приложение FCoffee может получить о Пользователе во время использования приложения.{nextLine}

            1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ{nextLine}

            1. В настоящей Политике конфиденциальности используются следующие термины:{nextLine}

            1.1. «Приложение FCoffee» – приложение.{nextLine}


            1.2. «Администрация » – уполномоченные сотрудники по управлению приложением FCoffee, действующие от имени Общества с ограниченной ответственностью «ФастКофе», которые организуют и (или) осуществляет обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.{nextLine}

            1.3. «Персональные данные» - любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).{nextLine}

            1.4. «Обработка персональных данных» - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.{nextLine}

            1.5. «Конфиденциальность персональных данных» - обязательное для соблюдения Администрацией Приложения FCoffee или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.{nextLine}

            1.6. «Пользователь Приложения FCoffee (далее Пользователь)» – лицо, имеющее доступ к Приложению FCoffee, посредством сети Интернет.{nextLine}

            2. ОБЩИЕ ПОЛОЖЕНИЯ{nextLine}

            2.1. Использование Пользователем Приложения означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.{nextLine}

            2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование Приложения.{nextLine}

            2.3. Настоящая Политика конфиденциальности применяется только к Приложению. Приложение не контролирует и не несет ответственность за приложения третьих лиц.{nextLine}
            
            2.4. Администрация Приложения не проверяет достоверность персональных данных, предоставляемых Пользователем Приложения. 
            </div>        
        </div>
    );
};

export default PrivacyText;